

import calendar
import datetime

day = int(input('Введить день вашего народження: '))
month = int(input('Введить місяць вашого народження'))
max_day = calendar.monthrange(2023,month)[1]

if not (1 <= day<= 31 and 1 <= month <=12):
    print('Помилка, день обо місяц направильний!')
    exit()

user_date = datetime.date(2023, month, day)
if datetime.date(2023, 1, 21) <=user_date <=datetime.date(2023, 2, 18):
    print('Ти Водолій')
    print('Пом’якшити гостроту щоденних викликів можуть допомогти прості та зрозумілі речі, як-от хобі. Одне з них — випікання, традиційне для українців ремесло, яке не тільки демонструє глибокий зв’язок між минулим і сьогоденням, а й сприяє віднайденню душевного спокою та фокусуванню на важливому тут і зараз')
    print('Все ок')

if datetime.date(2023, 2, 19) <=user_date <=datetime.date(2023, 3, 20):
    print('Ти Риби')
    print('Финансовый гороскоп на 2023 год для знака Рыбы говорит, что вас ждет многообещающий и благоприятный год в плане достатка')
    print('Все ок')

if datetime.date(2023, 3, 21) <=user_date <=datetime.date(2023, 4, 20):
    print('Ти Овен')
    print('Ви втомилися від шаленого темпу життя, від того, що немає часу на себе. Рік Тигра – час, щоб узяти паузу, адже він обіцяє бути багатим на сюрпризи та періодом для особистої трансформації. Овнам слід знайти час для відпочинку, більше подорожувати, зайнятися волонтерською діяльністю. Протягом цього року може виникнути можливість для досліджень та думок.')
    print('Все ок')

if datetime.date(2023, 4, 21) <=user_date <=datetime.date(2023, 5, 21):
    print('Ти Телець')
    print('Час знаходити більше часу для себе, адже здається, що робота стає сенсом вашого життя. Ви давно хотіли мандрувати новими країнами? Будь ласка! Планували ходити на масажі? Починайте! Астрологи рекомендують бути відкритими для нових вражень та не боятися змінюватися')
    print('Все ок')

if datetime.date(2023, 5, 22) <=user_date <=datetime.date(2023, 6, 21):
    print('Ти Близнята')
    print('Представники знака Близнят почуватимуться особливо комфортно в першій половині року, яка обіцяє активне спілкування, яскраві знайомства, розширення ділових контактів. Сила інтелекту, воля та рішучість будуть вашими помічниками. Люди, яких ви зустрінете, позитивно вплинуть на ваші поточні життєві та кар\'єрні цілі. Ви можете брати участь у соціальних проєктах, семінарах, тренінгах, конференціях, на якийсь час стати меценатом або ментором. Все це дасть плоди в майбутньому. У компанії однодумців отримаєте чудовий емоційний досвід, а в разі потреби у пошуку рішення – підтримку.')
    print('Все ок')

if datetime.date(2023, 6, 22) <=user_date <=datetime.date(2023, 7, 22):
    print('Ти Рак')
    print('Це можуть бути нові стосунки, нові ідеї, подорожі, вивчення іноземних мов чи інші захоплення. Це ваш рік, щоб розширити свій світогляд. Будьте цікавими, гнучкими, вірте в себе та не звертайте уваги на оточуючих. При цьому слід контролювати власні емоції')
    print('Все ок')

if datetime.date(2023, 7, 23) <=user_date <=datetime.date(2023, 8, 21):
    print('Ти Лев')
    print('рік для знака Лев каже, що вам слід зосередитись на сімейному житті, на розширенні фінансової співпраці та інвестицій, а також на власному внутрішньому світі. Крім того, це рік вашого кар’єрного зростання та змін, можливість вивчити нове та вдосконалити старі навички.')
    print('Все ок')

if datetime.date(2023, 8, 22) <=user_date <=datetime.date(2023, 9, 23):
    print('Ти Діва')
    print('Пом’якшити гостроту щоденних викликів можуть допомогти прості та зрозумілі речі, як-от хобі. Одне з них — гончарство, традиційне для українців ремесло, яке не тільки демонструє глибокий зв’язок між минулим і сьогоденням, а й сприяє віднайденню душевного спокою та фокусуванню на важливому тут і зара')
    print('Все ок')

if datetime.date(2023, 9, 24) <=user_date <=datetime.date(2023, 10, 23):
    print('Ти Терези')
    print('Перша половина року запам’ятається представникам знака Терезів динамічністю, азартом, чуттєвістю у сфері стосунків. Ви складете іспит на вміння обстоювати своє місце під сонцем, і найімовірніше — на відмінно. Ви конфліктуватимете, змагатиметеся з конкурентами, затято обстоюватимете свою точку зору. Переговори можуть бути емоційними, але в цьому процесі стане зрозуміло, за що йде бій і в якому напрямку рухатися далі. Схожа ситуація у взаєминах із коханими: якщо є правильне розуміння ролі конфлікту в сімейному житті, то італійські пристрасті сприятимуть емоційній розрядці — і, коли буде випущено пару, стосунки стануть міцнішими. До відома представників знака Терезів, народжених з 16 до 23 жовтня: ваші діти вимагатимуть більшої уваги до себе. Перша половина року — сприятливий період для зміцнення емоційного зв\'язку з ними.16У другому півріччі ймовірні ситуації, які складатимуться мимо вашої волі — це особливо стосується тих, хто народився з 8 по 16 жовтня. Якщо у вас є стратегія змін, цей етап може стати стартом для них, або ж сама ситуація підкаже, що і як настав час змінити. Потребуватиме перегляду, можливо, ваше ставлення до фінансів. Якщо необхідно взяти кредит або позичити гроші, будьте пильні: супутні витрати можуть виявитися більшими, ніж очікували. Вересень-жовтень — період вашої максимальної енергії, яка шукатиме, куди б себе спрямувати. На цей випадок варто мати в запасі кілька креативних ідей, аби почати реалізовувати їх і не змарнувати час.')
    print('Все ок')

if datetime.date(2023, 10, 24) <=user_date <=datetime.date(2023, 11, 22):
    print('Ти Скорпіон')
    print('У першому півріччі представникам знака Скорпіона варто урізноманітнити повсякденне життя. Наприклад, переглянути свої звички, оптимізувати розпорядок дня, налагодити харчування, проконсультуватися з фахівцем зі здорового способу життя, більше спілкуватися з домашніми улюбленцями. Ваш девіз: "Живемо тепер. Робимо те, що хочемо робити, і не виснажуємо себе". Така життєва філософія сприятиме вашій стресостійкості та посилюватиме емоційну гнучкість.')
    print('Все ок')

if datetime.date(2023, 11, 23) <=user_date <=datetime.date(2023, 12, 21):
    print('Ти Стрілець ')
    print('Перша половина року принесе натхнення, романтику, сприятливі можливості в реалізації проєктів, просуванні свого бренду. А хтось із представників знака Стрільця пізнає щастя батьківства. Рік запам’ятається різними заходами: весілля, ювілеї, дні народження — скрізь ви опинятиметеся в центрі уваги, перед вашою чарівністю та велелюбністю важко буде встояти. Спілкування стане для вас другим повітрям. З\'являться нові захоплення, ба більше: хобі може стати вашим проєктом. Також вірогідні приємні сюрпризи, подарунки')
    print('Все ок')

if datetime.date(2023, 12, 22) <=user_date <=datetime.date(2023, 1, 20):
    print('Ти Козеріг')
    print('У 2023 році, як кажуть астрологи, треба зосередитися на налагодженні зв’язків, на своїх творчих починаннях та захопленнях, залишаючись відкритими для змін, можливостей, партнерства та співпраці. Зірки радять знайти натхнення та друге дихання для своїх цілей заради досягнення мрії')
    print('Все ок')
